{
  "name": "Chiamaka",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Santos Chiamaka -",
  "headerTaglineThree": "A fullstack web developer",
  "headerTaglineFour": " based in Lagos, Nigeria.",
  "showCursor": false,
  "showBlog": false,
  "darkMode": true,
  "showResume": false,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "#"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "#"
    },
    {
      "id": "3",
      "title": "Twitter",
      "link": "#"
    },
    { "id": "4", "title": "Blog", "link": "#" },
    { "id": "5", "title": "Email", "link": "#" }
  ],
  "projects": [
    {
      "id": "1",
      "title": "Real-time Chat Application",
      "description": "A real-time chat application where users can create accounts, join different chat rooms, and exchange messages in real-time. Consider using technologies like WebSocket for real-time communication.",
      "imageSrc": "https://www.freecodecamp.org/news/content/images/size/w2000/2022/08/pexels-keira-burton-6146929.jpg",
      "url": "#"
    },
    {
      "id": "2",
      "title": "Task Management App",
      "description": "Create a task management application that allows users to create, update, and delete tasks. Implement user authentication to personalize task lists and add features like due dates and priority levels.",
      "imageSrc": "https://i.pinimg.com/736x/07/fe/b8/07feb85c3b7fc428dec58fa068839eb7.jpg",
      "url": "#"
    },
    {
      "id": "3",
      "title": "Expense Tracker",
      "description": "Develop a personal finance application to help users track their income and expenses. Implement features like budgeting, categorization, and visual representation of spending habits.",
      "imageSrc": "https://d11kg6go43tgrf.cloudfront.net/uploads/top-5-personal-expense-tracker-apps-to-manage-your-finances-750x500-1684742158.jpg",
      "url": "#"
    },
    {
      "id": "4",
      "title": "Job Board",
      "description": "Create a job board platform where employers can post job openings, and job seekers can apply. Include features like search functionality, filters, and notifications.",
      "imageSrc": "https://www.careeraddict.com/uploads/article/60308/job-search-apps.png",
      "url": "#"
    },
    {
      "id": "5",
      "title": "Social Media Dashboard",
      "description": "A simplified social media dashboard that allows users to post updates, like and comment on posts. Implement user profiles, authentication, and a clean, intuitive user interface.",
      "imageSrc": "https://cdn.dribbble.com/userupload/4390925/file/original-f770b035bf718b5d804242ebac740748.png?resize=400x0"
    },
    {
      "id": "6",
      "title": "Weather Application",
      "description": "A weather application that fetches data from a weather API and displays current weather conditions and forecasts. Enhance the user experience with a responsive design",
      "imageSrc": "https://cdn.dribbble.com/userupload/4152891/file/original-0e67241921d540b465286011afc0c8c6.webp?resize=400x0",
      "url": "#"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Web Development Technologies",
      "description": "I specialize in building modern, scalable, and responsive web applications using the MERN (MongoDB, Express.js, React, Node.js) stack. As a full-stack developer, I handle both the front-end and back-end aspects of the development process, ensuring a cohesive and seamless user experience."
    },
    {
      "id": "2",
      "title": "Responsive Design",
      "description": "I prioritize creating web applications that are not only visually appealing but also accessible on various devices. My commitment to responsive design ensures a seamless experience for users across desktops, tablets, and mobile devices."
    },
    {
      "id": "3",
      "title": "UI/UX Design",
      "description": "In addition to development, I bring a keen eye for design principles to the table. I strive to deliver user-friendly interfaces and compelling user experiences, combining functionality with aesthetic appeal."
    },
    {
      "id": "4",
      "title": "Database Management",
      "description": "I possess strong skills in designing and managing databases, with a particular focus on MongoDB. I ensure data integrity, security, and optimal performance for web applications that rely on efficient data storage and retrieval."
    }
  ],
  "aboutpara": "Hello, I'm Chiamaka, an 18-year-old computer science student and passionate full-stack web developer from Nigeria. My journey in web development started with a fascination for creating engaging websites. Specializing in the MERN stack, I seamlessly navigate both front-end and back-end development. I thrive on the challenge of turning ideas into reality through code, finding joy in designing user-friendly interfaces, optimizing databases, and implementing complex functionality. Committed to continuous learning, I stay updated on the latest trends and technologies, eager to contribute to the dynamic field of web development. I'm excited about collaborating on innovative projects and bringing ideas to life. Let's connect and explore the possibilities!"
}
